"Hey!! This is the guy who just recently bought me a house 🤔""I forgot to mention that he also gifted five Lamborghini’s""Shit who is this sexy man, was it you who bought me that beach house?""This is a look Stephen""Nr 2: guy at jazz bar. Nr 3: drug dealer at art museum. Nr 6: used to be rockstar""Sheshhh smo looking fresh😍😍""U give me joker vibe in the first one!🃏""You look like the sketchy person behind a dark alley way trying to persuade that what ur selling is not suspicious""fit goes hard👏🏽👏🏽""Ayo just wanted to publicly thank you for buying me the yacht the other day, great look by the way!!!""Woah😮""swag""Happy hanukkah my boy""Happy hanukkah my boy""HAPPY BIRTHDAY STEPHEN!!!""Happy birthday nutwill! 🥜""Happy Birthday naaa Stephen! Thank you for being soooo awesome! I wish you the best and I’ll miss you loadsssss na😙😙😙""happy birthday b. Ly bro no homo tho""HAPPY BIRJTDAY STEPH!! Have a good one n thanks for putting up w me :’) just saying ur gonna be dealing w my constant bs of wtf is this math question throughout the whole summer :))""AnywAys ur finally 15!! 🤧♥️""HBD fam have a gud one bruv♡♡♡""Happy birthday Stephen!! ♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️""Happy Bday b😍💓""My sister is growing up so much 😭""Happy birthday""Happy birthday steph😘""Happy birthday bro!! Sorry a little late but hope you enjoy the next year in life!!!""💦😘💦😘""happy birthday 🎊🎁 gonna miss u too🥺🥺""Harry styles who""💦💦😉😉😍😍♥️♥️""WTF 🔥🤣""DammnnN you go girlie! 💗💗""....""Send b0b and vaGenE""😏♥️😋🔞""WOW FABULOUS""GirllL did u use ur iPad to take these?! 😭😂""DAAMMNNN🔥🔥🔥 HONEYYY❤️❤️""So cute 🔥🔥🔥🔥""Wow cute 😘😘""Gotta love how you tagged me in this 😂""U slayy bbg😻""Oof yass honey YAS girl SLAYYY""Model material✨""H o t""Handsome boi🔥, LOOK AT THAT HAIR! I wish I have them""Can't believe I just saw this piece of art... 🥰🥰you're actually taking my breath away 😍😍😍 but srsly stop I'm gonna die of asphyxiation 😵😵""😍😍😍😍😍""nice one 😭😭""🥴🥴🥴🥴🥴""Last 300 years of hairstyles.""Wow daddy""🏳️‍🌈sexy and I love it🏳️‍🌈""SLAY! ❤️ QUEEN! ❤️ MAJOR OOOOOOF! ❤️""Damn girllllllllllllll😋""😩😩💦"